Управление_торговлей.ПБТ/src/InformationRegisters/УсловияКонтроляВзаиморасчетов/УсловияКонтроляВзаиморасчетов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>УсловияКонтроляВзаиморасчетов</name>
  <informationRegisterPeriodicity>Day</informationRegisterPeriodicity>
  <resources>
    <name>СуммаКредита</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>СрокКредита</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>ВалютаКредита</name>
    <type>
      <types>CatalogRef.Валюты</types>
    </type>
  </resources>
  <resources>
    <name>Календарь</name>
    <type>
      <types>CatalogRef.ПроизводственныеКалендари</types>
    </type>
  </resources>
  <dimensions>
    <name>ДоговорКонтрагента</name>
    <type>
      <types>CatalogRef.ДоговорыКонтрагентов</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

Управление_торговлей.ПБТ/src/CommonModules/КредитныйКонтроль/Module.bsl
Функция ПолучитьДатуПлатежаПоДатеДокумента(Знач ДатаДокумента, Знач Договор) Экспорт  //ПродажиСервер ПолучитьПоследнююДатуПоГрафику
	
	Если Не ЗначениеЗаполнено(ДатаДокумента) Тогда
		ДатаДокумента = ТекущаяДатаСеанса();
	КонецЕсли;
	
	Если ЗначениеЗаполнено(Договор) Тогда
		Запрос = Новый Запрос(
		"ВЫБРАТЬ
		|	УсловияКонтроляВзаиморасчетовСрезПоследних.СрокКредита КАК Сдвиг,
		|	НАЧАЛОПЕРИОДА(ДОБАВИТЬКДАТЕ(&ДатаДокумента, ДЕНЬ, ЕСТЬNULL(УсловияКонтроляВзаиморасчетовСрезПоследних.СрокКредита, 0)), ДЕНЬ) КАК ДатаПлатежа,
		|	УсловияКонтроляВзаиморасчетовСрезПоследних.Календарь КАК Календарь
		|ИЗ
		|	РегистрСведений.УсловияКонтроляВзаиморасчетов.СрезПоследних(&ДатаДокумента, ДоговорКонтрагента = &Договор) КАК УсловияКонтроляВзаиморасчетовСрезПоследних");
			
	Иначе
		Возврат ДатаДокумента;
	КонецЕсли;
	
	Запрос.УстановитьПараметр("ДатаДокумента", ДатаДокумента);
	Запрос.УстановитьПараметр("Договор", Договор);

	РезультатЗапроса = Запрос.Выполнить();
	Если РезультатЗапроса.Пустой() Тогда
		Возврат ДатаДокумента;
	КонецЕсли;
	
	Выборка = РезультатЗапроса.Выбрать();
	Выборка.Следующий();
	Календарь = Выборка.Календарь;
	
	Если ЗначениеЗаполнено(Календарь) Тогда
		ДатаПлатежа = КалендарныеГрафики.ДатаПоКалендарю(Календарь, ДатаДокумента, Выборка.Сдвиг);
	Иначе
		ДатаПлатежа = Выборка.ДатаПлатежа;
	КонецЕсли;
	
	Возврат ДатаПлатежа;
	
КонецФункции
